code-review/NRB_3471_3546/База_Стало/Reports/ЦенныеБумаги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ЦенныеБумаги</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/ИсторияИзмененияПараметровЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияИзмененияПараметровЦБ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПолноеНаименованиеЭмитента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КраткоеНаименованиеЭмитента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеВыпускаЦБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЦБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВекселей</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыФьючерсов</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыПаев</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОблигаций</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыДепозитарныхРасписок</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыАкций</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОпционов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЦБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЦБ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ISIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРегистрации</Name>
					<Comment>Государственный регистрационный номер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>Дата гос. регистрации</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНоминала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>20</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаНоминала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемРазмещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CFI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВнесенияВЕГРЮЛ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Comment>(Регл) Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дефолтная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Catalogs/ЮридическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЮридическиеЛица</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>(Регл) Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_ИНН_РФ_ДляНерезидентов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Comment>(Регл) </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>(Регл) Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРезидент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОПФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКОНХ</Name>
					<Comment>(Регл) </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКВЭД</Name>
					<Comment>(Регл) </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаполненияАнкеты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СведенияОСтруктуреОрганов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаГосРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоГосРегистрации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрирующийОрган</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКОГУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКФС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКОПФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународнаяОрганизация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КредитнаяОрганизация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УнифицированноеНаименованиеЦБРФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВнесенияВЕГРЮЛ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выгодоприобретатель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПая</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПаев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименованиеНаАнглийскомЯзыке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународнаяКомпания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСменыСтатусаМеждународнаяКомпания</Name>
					<Comment>Дата присвоения/снятия статуса 'Международная компания'</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДепонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыДепонентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеУсловия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакРегистрацииМеждународнойКомпании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакРегистрацииМеждународнойКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеВидыДеятельности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставУправления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Reports/ЦенныеБумаги/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	ПараметрСтдПериод = Настройки.ПараметрыДанных.Элементы.Найти("СтдПериод").Значение;
	ДанныеОтчета = РезультатЗапроса(ПараметрСтдПериод.ДатаНачала, ПараметрСтдПериод.ДатаОкончания);
	НаборыДанных = Новый Структура("ТаблицаОтчета", ДанныеОтчета);
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, НаборыДанных, ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
КонецПроцедуры

Функция РезультатЗапроса(ДатаНачала, ДатаОкончания)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПараметрыЦБСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
	               |	ПараметрыЦБСрезПоследних.ЦеннаяБумага.Наименование КАК ЦеннаяБумагаНаименование,
	               |	ПараметрыЦБСрезПоследних.ПолноеНаименованиеЭмитента КАК ПолноеНаименованиеЭмитента,
	               |	ПараметрыЦБСрезПоследних.КраткоеНаименованиеЭмитента КАК КраткоеНаименованиеЭмитента,
	               |	ВЫБОР
	               |		КОГДА ПараметрыЦБСрезПоследних.ИНН <> """"
	               |			ТОГДА ПараметрыЦБСрезПоследних.ИНН
	               |		КОГДА ПараметрыЦБСрезПоследних.TIN <> """"
	               |			ТОГДА ПараметрыЦБСрезПоследних.TIN
	               |		КОГДА ПараметрыЦБСрезПоследних.РегНомер <> """"
	               |			ТОГДА ПараметрыЦБСрезПоследних.РегНомер
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ИННЭмитента,
	               |	ПараметрыЦБСрезПоследних.ОГРН КАК ОГРНЭмитента,
	               |	ПараметрыЦБСрезПоследних.НаименованиеВыпускаЦБ КАК НаименованиеВыпускаЦБ,
	               |	ПараметрыЦБСрезПоследних.ВидЦБ КАК ВидЦБ,
	               |	ПараметрыЦБСрезПоследних.ТипЦБ КАК ТипЦБ,
	               |	ПараметрыЦБСрезПоследних.ISIN КАК ISIN,
	               |	ПараметрыЦБСрезПоследних.CFI КАК CFI,
	               |	ПараметрыЦБСрезПоследних.НомерРегистрации КАК НомерРегистрации,
	               |	ПараметрыЦБСрезПоследних.ДатаРегистрации КАК ДатаРегистрации,
	               |	ПараметрыЦБСрезПоследних.СуммаНоминала КАК СуммаНоминала,
	               |	ПараметрыЦБСрезПоследних.ВалютаНоминала КАК ВалютаНоминала,
	               |	ПараметрыЦБСрезПоследних.ОбъемРазмещения КАК ОбъемРазмещения,
	               |	&НачалоПериода КАК ДатаЗаписи
	               |ПОМЕСТИТЬ втЦБИстория
	               |ИЗ
	               |	РегистрСведений.ИсторияИзмененияПараметровЦБ.СрезПоследних(&НачалоПериода, ) КАК ПараметрыЦБСрезПоследних
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПараметрыЦБ.ЦеннаяБумага,
	               |	ПараметрыЦБ.ЦеннаяБумага.Наименование,
	               |	ПараметрыЦБ.ПолноеНаименованиеЭмитента,
	               |	ПараметрыЦБ.КраткоеНаименованиеЭмитента,
	               |	ВЫБОР
	               |		КОГДА ПараметрыЦБ.ИНН <> """"
	               |			ТОГДА ПараметрыЦБ.ИНН
	               |		КОГДА ПараметрыЦБ.TIN <> """"
	               |			ТОГДА ПараметрыЦБ.TIN
	               |		КОГДА ПараметрыЦБ.РегНомер <> """"
	               |			ТОГДА ПараметрыЦБ.РегНомер
	               |		ИНАЧЕ """"
	               |	КОНЕЦ,
	               |	ПараметрыЦБ.ОГРН,
	               |	ПараметрыЦБ.НаименованиеВыпускаЦБ,
	               |	ПараметрыЦБ.ВидЦБ,
	               |	ПараметрыЦБ.ТипЦБ,
	               |	ПараметрыЦБ.ISIN,
	               |	ПараметрыЦБ.CFI,
	               |	ПараметрыЦБ.НомерРегистрации,
	               |	ПараметрыЦБ.ДатаРегистрации,
	               |	ПараметрыЦБ.СуммаНоминала,
	               |	ПараметрыЦБ.ВалютаНоминала,
	               |	ПараметрыЦБ.ОбъемРазмещения,
	               |	ПараметрыЦБ.Период
	               |ИЗ
	               |	РегистрСведений.ИсторияИзмененияПараметровЦБ КАК ПараметрыЦБ
	               |ГДЕ
	               |	ПараметрыЦБ.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ЦеннаяБумага
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЦенныеБумаги.Ссылка КАК ЦеннаяБумага,
	               |	ЦенныеБумаги.Ссылка.Наименование КАК ЦеннаяБумагаНаименование,
	               |	ВЫРАЗИТЬ(ВЫРАЗИТЬ(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).ПолноеНаименование КАК СТРОКА(1024)) КАК ПолноеНаименованиеЭмитента,
	               |	ВЫРАЗИТЬ(ВЫРАЗИТЬ(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).Наименование КАК СТРОКА(1024)) КАК КраткоеНаименованиеЭмитента,
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).ИНН <> """"
	               |			ТОГДА ВЫРАЗИТЬ(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).ИНН
	               |		КОГДА ВЫРАЗИТЬ(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).TIN <> """"
	               |			ТОГДА ВЫРАЗИТЬ(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).TIN
	               |		КОГДА ВЫРАЗИТЬ(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).РегНомер <> """"
	               |			ТОГДА ВЫРАЗИТЬ(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).РегНомер
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ИННЭмитента,
	               |	ВЫРАЗИТЬ(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).ОГРН КАК ОГРНЭмитента,
	               |	ВЫРАЗИТЬ(ЦенныеБумаги.НаименованиеВыпуска КАК СТРОКА(1024)) КАК НаименованиеВыпускаЦБ,
	               |	ЦенныеБумаги.ВидЦБ КАК ВидЦБ,
	               |	ЦенныеБумаги.ТипЦБ КАК ТипЦБ,
	               |	ЦенныеБумаги.ISIN КАК ISIN,
	               |	ЦенныеБумаги.CFI КАК CFI,
	               |	ЦенныеБумаги.НомерРегистрации КАК НомерРегистрации,
	               |	ЦенныеБумаги.ДатаГосРег КАК ДатаРегистрации,
	               |	НоминалЦБ.Сумма КАК СуммаНоминала,
	               |	ЦенныеБумаги.ВалютаНоминала КАК ВалютаНоминала,
	               |	ЦенныеБумаги.ОбъемРазмещения КАК ОбъемРазмещения,
	               |	&НачалоПериода КАК ДатаЗаписи
	               |ПОМЕСТИТЬ втЦБНаОбслуживании
	               |ИЗ
	               |	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалЦБ.СрезПоследних(&НачалоПериода, ) КАК НоминалЦБ
	               |		ПО ЦенныеБумаги.Ссылка = НоминалЦБ.ЦеннаяБумага
	               |ГДЕ
	               |	ЦенныеБумаги.ДатаПриемаНаОбслуживание <> ДАТАВРЕМЯ(1, 1, 1)
	               |	И ЦенныеБумаги.ДатаПриемаНаОбслуживание <= &КонецПериода
	               |	И (ЦенныеБумаги.ДатаСнятияСОбслуживания = ДАТАВРЕМЯ(1, 1, 1)
	               |			ИЛИ ЦенныеБумаги.ДатаСнятияСОбслуживания >= &НачалоПериода)
	               |	И НЕ ЦенныеБумаги.ПометкаУдаления
	               |	И НЕ ЦенныеБумаги.ЭтоГруппа
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ЦеннаяБумага
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЦенныеБумаги.Ссылка КАК ЦеннаяБумага,
	               |	ЦенныеБумаги.Ссылка.Наименование КАК ЦеннаяБумагаНаименование,
	               |	ВЫРАЗИТЬ(ВЫРАЗИТЬ(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).ПолноеНаименование КАК СТРОКА(1024)) КАК ПолноеНаименованиеЭмитента,
	               |	ВЫРАЗИТЬ(ВЫРАЗИТЬ(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).Наименование КАК СТРОКА(1024)) КАК КраткоеНаименованиеЭмитента,
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).ИНН <> """"
	               |			ТОГДА ВЫРАЗИТЬ(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).ИНН
	               |		КОГДА ВЫРАЗИТЬ(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).TIN <> """"
	               |			ТОГДА ВЫРАЗИТЬ(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).TIN
	               |		КОГДА ВЫРАЗИТЬ(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).РегНомер <> """"
	               |			ТОГДА ВЫРАЗИТЬ(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).РегНомер
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ИННЭмитента,
	               |	ВЫРАЗИТЬ(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).ОГРН КАК ОГРНЭмитента,
	               |	ВЫРАЗИТЬ(ЦенныеБумаги.НаименованиеВыпуска КАК СТРОКА(1024)) КАК НаименованиеВыпускаЦБ,
	               |	ЦенныеБумаги.ВидЦБ КАК ВидЦБ,
	               |	ЦенныеБумаги.ТипЦБ КАК ТипЦБ,
	               |	ЦенныеБумаги.ISIN КАК ISIN,
	               |	ЦенныеБумаги.CFI КАК CFI,
	               |	ЦенныеБумаги.НомерРегистрации КАК НомерРегистрации,
	               |	ЦенныеБумаги.ДатаГосРег КАК ДатаРегистрации,
	               |	НоминалЦБ.Сумма КАК СуммаНоминала,
	               |	ЦенныеБумаги.ВалютаНоминала КАК ВалютаНоминала,
	               |	ЦенныеБумаги.ОбъемРазмещения КАК ОбъемРазмещения,
	               |	ЦенныеБумаги.ДатаНаложенияОграничений КАК ДатаЗаписи,
	               |	ЦенныеБумаги.ДополнительныеСведенияПоОграничению КАК ДополнительныеСведения
	               |ПОМЕСТИТЬ втСобытияОграниченияЦБ
	               |ИЗ
	               |	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалЦБ.СрезПоследних(, ) КАК НоминалЦБ
	               |		ПО ЦенныеБумаги.Ссылка = НоминалЦБ.ЦеннаяБумага
	               |ГДЕ
	               |	ЦенныеБумаги.ДатаПриемаНаОбслуживание <> ДАТАВРЕМЯ(1, 1, 1)
	               |	И ЦенныеБумаги.ДатаПриемаНаОбслуживание <= &КонецПериода
	               |	И (ЦенныеБумаги.ДатаСнятияСОбслуживания = ДАТАВРЕМЯ(1, 1, 1)
	               |			ИЛИ ЦенныеБумаги.ДатаСнятияСОбслуживания >= &НачалоПериода)
	               |	И НЕ ЦенныеБумаги.ПометкаУдаления
	               |	И НЕ ЦенныеБумаги.ЭтоГруппа
	               |	И ЦенныеБумаги.ДатаНаложенияОграничений МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЦенныеБумаги.Ссылка,
	               |	ЦенныеБумаги.Ссылка.Наименование,
	               |	ВЫРАЗИТЬ(ВЫРАЗИТЬ(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).ПолноеНаименование КАК СТРОКА(1024)),
	               |	ВЫРАЗИТЬ(ВЫРАЗИТЬ(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).Наименование КАК СТРОКА(1024)),
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).ИНН <> """"
	               |			ТОГДА ВЫРАЗИТЬ(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).ИНН
	               |		КОГДА ВЫРАЗИТЬ(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).TIN <> """"
	               |			ТОГДА ВЫРАЗИТЬ(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).TIN
	               |		КОГДА ВЫРАЗИТЬ(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).РегНомер <> """"
	               |			ТОГДА ВЫРАЗИТЬ(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).РегНомер
	               |		ИНАЧЕ """"
	               |	КОНЕЦ,
	               |	ВЫРАЗИТЬ(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).ОГРН,
	               |	ВЫРАЗИТЬ(ЦенныеБумаги.НаименованиеВыпуска КАК СТРОКА(1024)),
	               |	ЦенныеБумаги.ВидЦБ,
	               |	ЦенныеБумаги.ТипЦБ,
	               |	ЦенныеБумаги.ISIN,
	               |	ЦенныеБумаги.CFI,
	               |	ЦенныеБумаги.НомерРегистрации,
	               |	ЦенныеБумаги.ДатаГосРег,
	               |	НоминалЦБ.Сумма,
	               |	ЦенныеБумаги.ВалютаНоминала,
	               |	ЦенныеБумаги.ОбъемРазмещения,
	               |	ЦенныеБумаги.ДатаСнятияОграничений,
	               |	ЦенныеБумаги.ДополнительныеСведенияПоСнятиюОграничения
	               |ИЗ
	               |	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалЦБ.СрезПоследних(, ) КАК НоминалЦБ
	               |		ПО ЦенныеБумаги.Ссылка = НоминалЦБ.ЦеннаяБумага
	               |ГДЕ
	               |	ЦенныеБумаги.ДатаПриемаНаОбслуживание <> ДАТАВРЕМЯ(1, 1, 1)
	               |	И ЦенныеБумаги.ДатаПриемаНаОбслуживание <= &КонецПериода
	               |	И (ЦенныеБумаги.ДатаСнятияСОбслуживания = ДАТАВРЕМЯ(1, 1, 1)
	               |			ИЛИ ЦенныеБумаги.ДатаСнятияСОбслуживания >= &НачалоПериода)
	               |	И НЕ ЦенныеБумаги.ПометкаУдаления
	               |	И НЕ ЦенныеБумаги.ЭтоГруппа
	               |	И ЦенныеБумаги.ДатаСнятияОграничений МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ЦеннаяБумага
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НаОбслуживании.ЦеннаяБумага КАК ЦеннаяБумага
	               |ПОМЕСТИТЬ втОбъединенныйСписок
	               |ИЗ
	               |	втЦБНаОбслуживании КАК НаОбслуживании
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	История.ЦеннаяБумага
	               |ИЗ
	               |	втЦБИстория КАК История
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ЦеннаяБумага
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОбъединенныйСписок.ЦеннаяБумага КАК ЦеннаяБумага,
	               |	История.ЦеннаяБумагаНаименование КАК ЦеннаяБумагаНаименование,
	               |	ВЫРАЗИТЬ(История.ПолноеНаименованиеЭмитента КАК СТРОКА(1024)) КАК ПолноеНаименованиеЭмитента,
	               |	ВЫРАЗИТЬ(История.КраткоеНаименованиеЭмитента КАК СТРОКА(1024)) КАК КраткоеНаименованиеЭмитента,
	               |	История.ИННЭмитента КАК ИННЭмитента,
	               |	История.ОГРНЭмитента КАК ОГРНЭмитента,
	               |	ВЫРАЗИТЬ(История.НаименованиеВыпускаЦБ КАК СТРОКА(1024)) КАК НаименованиеВыпускаЦБ,
	               |	История.ВидЦБ КАК ВидЦБ,
	               |	История.ТипЦБ КАК ТипЦБ,
	               |	История.ISIN КАК ISIN,
	               |	История.CFI КАК CFI,
	               |	История.НомерРегистрации КАК НомерРегистрации,
	               |	История.ДатаРегистрации КАК ДатаРегистрации,
	               |	История.СуммаНоминала КАК СуммаНоминала,
	               |	История.ВалютаНоминала КАК ВалютаНоминала,
	               |	История.ОбъемРазмещения КАК ОбъемРазмещения,
	               |	История.ДатаЗаписи КАК ДатаЗаписи,
	               |	ВЫБОР
	               |		КОГДА История.ДатаЗаписи ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ДанныеЗаполнены
	               |ПОМЕСТИТЬ втДополнениеИзИстории
	               |ИЗ
	               |	втОбъединенныйСписок КАК ОбъединенныйСписок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втЦБИстория КАК История
	               |		ПО ОбъединенныйСписок.ЦеннаяБумага = История.ЦеннаяБумага
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ЦеннаяБумага
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	История.ЦеннаяБумага КАК ЦеннаяБумага,
	               |	ЕСТЬNULL(НаОбслуживании.ЦеннаяБумагаНаименование, История.ЦеннаяБумагаНаименование) КАК ЦеннаяБумагаНаименование,
	               |	ЕСТЬNULL(НаОбслуживании.ПолноеНаименованиеЭмитента, История.ПолноеНаименованиеЭмитента) КАК ПолноеНаименованиеЭмитента,
	               |	ЕСТЬNULL(НаОбслуживании.КраткоеНаименованиеЭмитента, История.КраткоеНаименованиеЭмитента) КАК КраткоеНаименованиеЭмитента,
	               |	ЕСТЬNULL(НаОбслуживании.ИННЭмитента, История.ИННЭмитента) КАК ИННЭмитента,
	               |	ЕСТЬNULL(НаОбслуживании.ОГРНЭмитента, История.ОГРНЭмитента) КАК ОГРНЭмитента,
	               |	ЕСТЬNULL(НаОбслуживании.НаименованиеВыпускаЦБ, История.НаименованиеВыпускаЦБ) КАК НаименованиеВыпускаЦБ,
	               |	ЕСТЬNULL(НаОбслуживании.ВидЦБ, История.ВидЦБ) КАК ВидЦБ,
	               |	ЕСТЬNULL(НаОбслуживании.ТипЦБ, История.ТипЦБ) КАК ТипЦБ,
	               |	ЕСТЬNULL(НаОбслуживании.ISIN, История.ISIN) КАК ISIN,
	               |	ЕСТЬNULL(НаОбслуживании.CFI, История.CFI) КАК CFI,
	               |	ЕСТЬNULL(НаОбслуживании.НомерРегистрации, История.НомерРегистрации) КАК НомерРегистрации,
	               |	ЕСТЬNULL(НаОбслуживании.ДатаРегистрации, История.ДатаРегистрации) КАК ДатаРегистрации,
	               |	ЕСТЬNULL(НаОбслуживании.СуммаНоминала, История.СуммаНоминала) КАК СуммаНоминала,
	               |	ЕСТЬNULL(НаОбслуживании.ВалютаНоминала, История.ВалютаНоминала) КАК ВалютаНоминала,
	               |	ЕСТЬNULL(НаОбслуживании.ОбъемРазмещения, История.ОбъемРазмещения) КАК ОбъемРазмещения,
	               |	ЕСТЬNULL(НаОбслуживании.ДатаЗаписи, История.ДатаЗаписи) КАК ДатаЗаписи,
	               |	"""" КАК ДопИнформация
	               |ПОМЕСТИТЬ втИтоговаяПоВсемЦБ
	               |ИЗ
	               |	втДополнениеИзИстории КАК История
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втЦБНаОбслуживании КАК НаОбслуживании
	               |		ПО История.ЦеннаяБумага = НаОбслуживании.ЦеннаяБумага
	               |			И (НЕ История.ДанныеЗаполнены)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	втСобытияОграниченияЦБ.ЦеннаяБумага,
	               |	втСобытияОграниченияЦБ.ЦеннаяБумагаНаименование,
	               |	втСобытияОграниченияЦБ.ПолноеНаименованиеЭмитента,
	               |	втСобытияОграниченияЦБ.КраткоеНаименованиеЭмитента,
	               |	втСобытияОграниченияЦБ.ИННЭмитента,
	               |	втСобытияОграниченияЦБ.ОГРНЭмитента,
	               |	втСобытияОграниченияЦБ.НаименованиеВыпускаЦБ,
	               |	втСобытияОграниченияЦБ.ВидЦБ,
	               |	втСобытияОграниченияЦБ.ТипЦБ,
	               |	втСобытияОграниченияЦБ.ISIN,
	               |	втСобытияОграниченияЦБ.CFI,
	               |	втСобытияОграниченияЦБ.НомерРегистрации,
	               |	втСобытияОграниченияЦБ.ДатаРегистрации,
	               |	втСобытияОграниченияЦБ.СуммаНоминала,
	               |	втСобытияОграниченияЦБ.ВалютаНоминала,
	               |	втСобытияОграниченияЦБ.ОбъемРазмещения,
	               |	втСобытияОграниченияЦБ.ДатаЗаписи,
	               |	втСобытияОграниченияЦБ.ДополнительныеСведения
	               |ИЗ
	               |	втСобытияОграниченияЦБ КАК втСобытияОграниченияЦБ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втИтоговаяПоВсемЦБ.ЦеннаяБумага КАК ЦеннаяБумага,
	               |	втИтоговаяПоВсемЦБ.ЦеннаяБумагаНаименование КАК ЦеннаяБумагаНаименование,
	               |	втИтоговаяПоВсемЦБ.ПолноеНаименованиеЭмитента КАК ПолноеНаименованиеЭмитента,
	               |	втИтоговаяПоВсемЦБ.КраткоеНаименованиеЭмитента КАК КраткоеНаименованиеЭмитента,
	               |	втИтоговаяПоВсемЦБ.ИННЭмитента КАК ИННЭмитента,
	               |	втИтоговаяПоВсемЦБ.ОГРНЭмитента КАК ОГРНЭмитента,
	               |	втИтоговаяПоВсемЦБ.НаименованиеВыпускаЦБ КАК НаименованиеВыпускаЦБ,
	               |	втИтоговаяПоВсемЦБ.ВидЦБ КАК ВидЦБ,
	               |	втИтоговаяПоВсемЦБ.ТипЦБ КАК ТипЦБ,
	               |	втИтоговаяПоВсемЦБ.ISIN КАК ISIN,
	               |	втИтоговаяПоВсемЦБ.CFI КАК CFI,
	               |	втИтоговаяПоВсемЦБ.НомерРегистрации КАК НомерРегистрации,
	               |	втИтоговаяПоВсемЦБ.ДатаРегистрации КАК ДатаРегистрации,
	               |	втИтоговаяПоВсемЦБ.СуммаНоминала КАК СуммаНоминала,
	               |	втИтоговаяПоВсемЦБ.ВалютаНоминала КАК ВалютаНоминала,
	               |	втИтоговаяПоВсемЦБ.ОбъемРазмещения КАК ОбъемРазмещения,
	               |	втИтоговаяПоВсемЦБ.ДатаЗаписи КАК ДатаЗаписи,
	               |	втИтоговаяПоВсемЦБ.ДопИнформация КАК ДопИнформация
	               |ИЗ
	               |	втИтоговаяПоВсемЦБ КАК втИтоговаяПоВсемЦБ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЦБНаОбслуживании КАК втЦБНаОбслуживании
	               |		ПО втИтоговаяПоВсемЦБ.ЦеннаяБумага = втЦБНаОбслуживании.ЦеннаяБумага";
	Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
		Запрос.УстановитьПараметр("НачалоПериода", ДатаОкончания);
		СтрокаПоиска = 
		"ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	История.ЦеннаяБумага
		|ИЗ
		|	втЦБИстория КАК История";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, СтрокаПоиска, "");
	Иначе
		Запрос.УстановитьПараметр("НачалоПериода", ДатаНачала);
	КонецЕсли;
	Запрос.УстановитьПараметр("КонецПериода", ДатаОкончания);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	// Установить значения флагов, показывающих на измененные поля
	ТЗ.Колонки.Добавить("ЗначениеИстина");
	ТЗ.ЗаполнитьЗначения(Истина, "ЗначениеИстина");
	
	ПроверяемыеПоля = Новый Структура("ПолноеНаименованиеЭмитента, КраткоеНаименованиеЭмитента, ИННЭмитента, ОГРНЭмитента,
		|НаименованиеВыпускаЦБ, ВидЦБ, ТипЦБ, ISIN, CFI, НомерРегистрации, ДатаРегистрации, СуммаНоминала,
		|ВалютаНоминала, ОбъемРазмещения",
		"", "", "", "", "", "", "", "", "", "", "", "", "", "");
	РасширитьСтруктуруТаблицы(ТЗ, ПроверяемыеПоля);
	
	ТекЦБ = "";
	Для Инд = 0 По ТЗ.Количество()-1 Цикл
		Если Инд > 0 Тогда
			Если ТекЦБ = ТЗ[Инд].ЦеннаяБумага Тогда
				ОтметитьИзмененныеПоля(ТЗ[Инд], ПроверяемыеПоля);
			КонецЕсли;
		КонецЕсли;
		ТекЦБ = ТЗ[Инд].ЦеннаяБумага;
		ЗаполнитьЗначенияСвойств(ПроверяемыеПоля, ТЗ[Инд]);
	КонецЦикла;
	
	Возврат ТЗ;
КонецФункции

Процедура РасширитьСтруктуруТаблицы(ТЗ, ПроверяемыеПоля)
	Для Каждого Элемент Из ПроверяемыеПоля Цикл
		ТЗ.Колонки.Добавить("Изм"+Элемент.Ключ);
		ТЗ.ЗаполнитьЗначения(Ложь, "Изм"+Элемент.Ключ);
	КонецЦикла;
КонецПроцедуры

Процедура ОтметитьИзмененныеПоля(Строка, ПроверяемыеПоля);
	Для Каждого Элемент Из ПроверяемыеПоля Цикл
		Если Элемент.Значение <> Строка[Элемент.Ключ] Тогда
			Строка["Изм"+Элемент.Ключ] = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
